{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "do_sample": false,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
     "0": "O",
     "1": "Data_Structure",
     "2": "Code_Block",
     "3": "Application",
     "4": "Function",
     "5": "Data_Type",
     "6": "Language",
     "7": "Library",
     "8": "Variable",
     "9": "Value",
     "10": "Device",
     "11": "User_Name",
     "12": "User_Interface_Element",
     "13": "Output_Block",
     "14": "Error_Name",
     "15": "Class",
     "16": "Website",
     "17": "Version",
     "18": "File_Name",
     "19": "File_Type",
     "20": "Operating_System",
     "21": "Algorithm",
     "22": "Organization",
     "23": "HTML_XML_Tag",
     "24": "Keyboard_IP",
     "25": "Licence"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
     "O": 0,
     "Data_Structure": 1,
     "Code_Block": 2,
     "Application": 3,
     "Function": 4,
     "Data_Type": 5,
     "Language": 6,
     "Library": 7,
     "Variable": 8,
     "Value": 9,
     "Device": 10,
     "User_Name": 11,
     "User_Interface_Element": 12,
     "Output_Block": 13,
     "Error_Name": 14,
     "Class": 15,
     "Website": 16,
     "Version": 17,
     "File_Name": 18,
     "File_Type": 19,
     "Operating_System": 20,
     "Algorithm": 21,
     "Organization": 22,
     "HTML_XML_Tag": 23,
     "Keyboard_IP": 24,
     "Licence": 25
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.0,
  "max_length": 20,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_beams": 1,
  "num_hidden_layers": 12,
  "num_labels": 14,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_past": true,
  "pad_token_id": 0,
  "pruned_heads": {},
  "repetition_penalty": 1.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "vocab_size": 82000
}

